In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('./raw_data/UK_population_data.xlsx')
df.head()

,Name,Adm.,Population,Population.1,Population.2
0,NaN,NaN,Census (C),Census (C),Census (C)
1,NaN,NaN,2001-04-29 00:00:00,2011-03-27 00:00:00,2021-03-21 00:00:00
2,Aberdeen,SCO,185560,195453,196220
3,Ashford,ENG,58641,72669,82164
4,Aylesbury,ENG,65973,72490,87967

In [3]:
df.drop(0, inplace=True)
df.drop(1, inplace=True)
df = df.reset_index()
del df['index']
df.head()

        Name Adm. Population Population.1 Population.2
0   Aberdeen  SCO     185560       195453       196220
1    Ashford  ENG      58641        72669        82164
2  Aylesbury  ENG      65973        72490        87967
3    Banbury  ENG      41708        46727        52052
4     Bangor  NIR      58368        61401        64596

In [4]:
df = df.drop(columns=['Population', 'Population.1'])

In [5]:
df.rename(columns = {'Name':'City', 'Adm.':'Country', 'Population.2':'2021_Population'}, inplace = True)

In [6]:
df['Country'].value_counts()

Country
ENG    176
SCO     11
NIR      7
WAL      5
Name: count, dtype: int64

In [7]:
df = df[df.Country != 'NIR']

In [8]:
def change_country(country):
    if country == 'SCO':
        country = "Scotland"
    elif country == "ENG":
        country = "England"
    elif country == "WAL":
        country = "Wales"
    return country

In [9]:
df["Country"] = df["Country"].apply(change_country)

In [10]:
df.head()

        City   Country 2021_Population
0   Aberdeen  Scotland          196220
1    Ashford   England           82164
2  Aylesbury   England           87967
3    Banbury   England           52052
5   Barnsley   England           71422

In [11]:
df['City'] = df['City'].astype(str)
df['Country'] = df['Country'].astype(str)

In [12]:
df['Location'] =  df["City"] + ', ' + df["Country"]

In [13]:
df

            City   Country 2021_Population              Location
0       Aberdeen  Scotland          196220    Aberdeen, Scotland
1        Ashford   England           82164      Ashford, England
2      Aylesbury   England           87967    Aylesbury, England
3        Banbury   England           52052      Banbury, England
5       Barnsley   England           71422     Barnsley, England
..           ...       ...             ...                   ...
194    Worcester   England          105455    Worcester, England
195     Worthing   England          111621     Worthing, England
196  Wythenshawe   England           97635  Wythenshawe, England
197       Yeovil   England           50176       Yeovil, England
198         York   England          141671         York, England

[192 rows x 4 columns]

In [14]:
output = df.to_csv('./cleaned_data/UK_population_data.csv', index=False, mode = 'w+')

## Bibliography

https://www.citypopulation.de/en/uk/cities/